earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Raspberry Pi Pico (pico-debug)
# -----------------------------------
rpipicopicodebug.name=Raspberry Pi Pico (pico-debug)
rpipicopicodebug.vid.0=0x1209
rpipicopicodebug.pid.0=0x2488
rpipicopicodebug.build.usbpid=-DSERIALUSB_PID=0x000a
rpipicopicodebug.build.usbpwr=-DUSBD_MAX_POWER_MA=250
rpipicopicodebug.build.board=RASPBERRY_PI_PICO
rpipicopicodebug.build.mcu=cortex-m0plus
rpipicopicodebug.build.variant=rpipico
rpipicopicodebug.upload.tool=picodebug
rpipicopicodebug.upload.maximum_size=2097152
rpipicopicodebug.upload.maximum_data_size=245760
rpipicopicodebug.upload.wait_for_upload_port=true
rpipicopicodebug.upload.erase_cmd=
rpipicopicodebug.serial.disableDTR=false
rpipicopicodebug.serial.disableRTS=false
rpipicopicodebug.build.f_cpu=125000000
rpipicopicodebug.build.led=
rpipicopicodebug.build.core=rp2040
rpipicopicodebug.build.ldscript=memmap_default.ld
rpipicopicodebug.build.ram_length=240k
rpipicopicodebug.build.boot2=boot2_w25q080_2_padded_checksum
rpipicopicodebug.build.vid=0x2e8a
rpipicopicodebug.build.pid=0x000a
rpipicopicodebug.build.usb_manufacturer="Raspberry Pi"
rpipicopicodebug.build.usb_product="Pico (pico-debug)"
rpipicopicodebug.menu.flash.2097152_0=2MB (no FS)
rpipicopicodebug.menu.flash.2097152_0.upload.maximum_size=2093056
rpipicopicodebug.menu.flash.2097152_0.build.flash_length=2093056
rpipicopicodebug.menu.flash.2097152_0.build.eeprom_start=270528512
rpipicopicodebug.menu.flash.2097152_0.build.fs_start=270528512
rpipicopicodebug.menu.flash.2097152_0.build.fs_end=270528512
rpipicopicodebug.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
rpipicopicodebug.menu.flash.2097152_65536.upload.maximum_size=2027520
rpipicopicodebug.menu.flash.2097152_65536.build.flash_length=2027520
rpipicopicodebug.menu.flash.2097152_65536.build.eeprom_start=270528512
rpipicopicodebug.menu.flash.2097152_65536.build.fs_start=270462976
rpipicopicodebug.menu.flash.2097152_65536.build.fs_end=270528512
rpipicopicodebug.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
rpipicopicodebug.menu.flash.2097152_131072.upload.maximum_size=1961984
rpipicopicodebug.menu.flash.2097152_131072.build.flash_length=1961984
rpipicopicodebug.menu.flash.2097152_131072.build.eeprom_start=270528512
rpipicopicodebug.menu.flash.2097152_131072.build.fs_start=270397440
rpipicopicodebug.menu.flash.2097152_131072.build.fs_end=270528512
rpipicopicodebug.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
rpipicopicodebug.menu.flash.2097152_262144.upload.maximum_size=1830912
rpipicopicodebug.menu.flash.2097152_262144.build.flash_length=1830912
rpipicopicodebug.menu.flash.2097152_262144.build.eeprom_start=270528512
rpipicopicodebug.menu.flash.2097152_262144.build.fs_start=270266368
rpipicopicodebug.menu.flash.2097152_262144.build.fs_end=270528512
rpipicopicodebug.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
rpipicopicodebug.menu.flash.2097152_524288.upload.maximum_size=1568768
rpipicopicodebug.menu.flash.2097152_524288.build.flash_length=1568768
rpipicopicodebug.menu.flash.2097152_524288.build.eeprom_start=270528512
rpipicopicodebug.menu.flash.2097152_524288.build.fs_start=270004224
rpipicopicodebug.menu.flash.2097152_524288.build.fs_end=270528512
rpipicopicodebug.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
rpipicopicodebug.menu.flash.2097152_1048576.upload.maximum_size=1044480
rpipicopicodebug.menu.flash.2097152_1048576.build.flash_length=1044480
rpipicopicodebug.menu.flash.2097152_1048576.build.eeprom_start=270528512
rpipicopicodebug.menu.flash.2097152_1048576.build.fs_start=269479936
rpipicopicodebug.menu.flash.2097152_1048576.build.fs_end=270528512
rpipicopicodebug.menu.freq.133=133 MHz
rpipicopicodebug.menu.freq.133.build.f_cpu=133000000L
rpipicopicodebug.menu.freq.50=50 MHz
rpipicopicodebug.menu.freq.50.build.f_cpu=50000000L
rpipicopicodebug.menu.freq.100=100 MHz
rpipicopicodebug.menu.freq.100.build.f_cpu=100000000L
rpipicopicodebug.menu.freq.125=125 MHz
rpipicopicodebug.menu.freq.125.build.f_cpu=125000000L
rpipicopicodebug.menu.freq.150=150 MHz (Overclock)
rpipicopicodebug.menu.freq.150.build.f_cpu=150000000L
rpipicopicodebug.menu.freq.175=175 MHz (Overclock)
rpipicopicodebug.menu.freq.175.build.f_cpu=175000000L
rpipicopicodebug.menu.freq.200=200 MHz (Overclock)
rpipicopicodebug.menu.freq.200.build.f_cpu=200000000L
rpipicopicodebug.menu.freq.225=225 MHz (Overclock)
rpipicopicodebug.menu.freq.225.build.f_cpu=225000000L
rpipicopicodebug.menu.freq.250=250 MHz (Overclock)
rpipicopicodebug.menu.freq.250.build.f_cpu=250000000L
rpipicopicodebug.menu.freq.275=275 MHz (Overclock)
rpipicopicodebug.menu.freq.275.build.f_cpu=275000000L
rpipicopicodebug.menu.freq.300=300 MHz (Overclock)
rpipicopicodebug.menu.freq.300.build.f_cpu=300000000L
rpipicopicodebug.menu.opt.Small=Small (-Os) (standard)
rpipicopicodebug.menu.opt.Small.build.flags.optimize=-Os
rpipicopicodebug.menu.opt.Optimize=Optimize (-O)
rpipicopicodebug.menu.opt.Optimize.build.flags.optimize=-O
rpipicopicodebug.menu.opt.Optimize2=Optimize More (-O2)
rpipicopicodebug.menu.opt.Optimize2.build.flags.optimize=-O2
rpipicopicodebug.menu.opt.Optimize3=Optimize Even More (-O3)
rpipicopicodebug.menu.opt.Optimize3.build.flags.optimize=-O3
rpipicopicodebug.menu.opt.Fast=Fast (-Ofast) (maybe slower)
rpipicopicodebug.menu.opt.Fast.build.flags.optimize=-Ofast
rpipicopicodebug.menu.opt.Debug=Debug (-Og)
rpipicopicodebug.menu.opt.Debug.build.flags.optimize=-Og
rpipicopicodebug.menu.rtti.Disabled=Disabled
rpipicopicodebug.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
rpipicopicodebug.menu.rtti.Enabled=Enabled
rpipicopicodebug.menu.rtti.Enabled.build.flags.rtti=
rpipicopicodebug.menu.dbgport.Disabled=Disabled
rpipicopicodebug.menu.dbgport.Disabled.build.debug_port=
rpipicopicodebug.menu.dbgport.Serial=Serial
rpipicopicodebug.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
rpipicopicodebug.menu.dbgport.Serial1=Serial1
rpipicopicodebug.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
rpipicopicodebug.menu.dbgport.Serial2=Serial2
rpipicopicodebug.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
rpipicopicodebug.menu.dbglvl.None=None
rpipicopicodebug.menu.dbglvl.None.build.debug_level=
rpipicopicodebug.menu.dbglvl.Core=Core
rpipicopicodebug.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
rpipicopicodebug.menu.dbglvl.SPI=SPI
rpipicopicodebug.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
rpipicopicodebug.menu.dbglvl.Wire=Wire
rpipicopicodebug.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
rpipicopicodebug.menu.dbglvl.All=All
rpipicopicodebug.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
rpipicopicodebug.menu.dbglvl.NDEBUG=NDEBUG
rpipicopicodebug.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
rpipicopicodebug.menu.usbstack.nousb=No USB
rpipicopicodebug.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"

# -----------------------------------
# Sysis uno2040
# -----------------------------------
seuno2040.name=Sysis uno2040
seuno2040.vid.0=0x2e8a
seuno2040.pid.0=0x000a
seuno2040.build.usbpid=-DSERIALUSB_PID=0x000a
seuno2040.build.usbpwr=-DUSBD_MAX_POWER_MA=250
seuno2040.build.board=SYSIS_UNO_2040
seuno2040.build.mcu=cortex-m0plus
seuno2040.build.variant=seuno2040
seuno2040.upload.tool=uf2conv
seuno2040.upload.maximum_size=2097152
seuno2040.upload.maximum_data_size=262144
seuno2040.upload.wait_for_upload_port=true
seuno2040.upload.erase_cmd=
seuno2040.serial.disableDTR=false
seuno2040.serial.disableRTS=false
seuno2040.build.f_cpu=125000000
seuno2040.build.led=
seuno2040.build.core=rp2040
seuno2040.build.ldscript=memmap_default.ld
seuno2040.build.ram_length=256k
seuno2040.build.boot2=boot2_w25q080_2_padded_checksum
seuno2040.build.vid=0x2e8a
seuno2040.build.pid=0x000a
seuno2040.build.usb_manufacturer="Sysis"
seuno2040.build.usb_product="uno2040"
seuno2040.menu.flash.2097152_0=2MB (no FS)
seuno2040.menu.flash.2097152_0.upload.maximum_size=2093056
seuno2040.menu.flash.2097152_0.build.flash_length=2093056
seuno2040.menu.flash.2097152_0.build.eeprom_start=270528512
seuno2040.menu.flash.2097152_0.build.fs_start=270528512
seuno2040.menu.flash.2097152_0.build.fs_end=270528512
seuno2040.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
seuno2040.menu.flash.2097152_65536.upload.maximum_size=2027520
seuno2040.menu.flash.2097152_65536.build.flash_length=2027520
seuno2040.menu.flash.2097152_65536.build.eeprom_start=270528512
seuno2040.menu.flash.2097152_65536.build.fs_start=270462976
seuno2040.menu.flash.2097152_65536.build.fs_end=270528512
seuno2040.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
seuno2040.menu.flash.2097152_131072.upload.maximum_size=1961984
seuno2040.menu.flash.2097152_131072.build.flash_length=1961984
seuno2040.menu.flash.2097152_131072.build.eeprom_start=270528512
seuno2040.menu.flash.2097152_131072.build.fs_start=270397440
seuno2040.menu.flash.2097152_131072.build.fs_end=270528512
seuno2040.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
seuno2040.menu.flash.2097152_262144.upload.maximum_size=1830912
seuno2040.menu.flash.2097152_262144.build.flash_length=1830912
seuno2040.menu.flash.2097152_262144.build.eeprom_start=270528512
seuno2040.menu.flash.2097152_262144.build.fs_start=270266368
seuno2040.menu.flash.2097152_262144.build.fs_end=270528512
seuno2040.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
seuno2040.menu.flash.2097152_524288.upload.maximum_size=1568768
seuno2040.menu.flash.2097152_524288.build.flash_length=1568768
seuno2040.menu.flash.2097152_524288.build.eeprom_start=270528512
seuno2040.menu.flash.2097152_524288.build.fs_start=270004224
seuno2040.menu.flash.2097152_524288.build.fs_end=270528512
seuno2040.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
seuno2040.menu.flash.2097152_1048576.upload.maximum_size=1044480
seuno2040.menu.flash.2097152_1048576.build.flash_length=1044480
seuno2040.menu.flash.2097152_1048576.build.eeprom_start=270528512
seuno2040.menu.flash.2097152_1048576.build.fs_start=269479936
seuno2040.menu.flash.2097152_1048576.build.fs_end=270528512
seuno2040.menu.freq.133=133 MHz
seuno2040.menu.freq.133.build.f_cpu=133000000L
seuno2040.menu.freq.50=50 MHz
seuno2040.menu.freq.50.build.f_cpu=50000000L
seuno2040.menu.freq.100=100 MHz
seuno2040.menu.freq.100.build.f_cpu=100000000L
seuno2040.menu.freq.125=125 MHz
seuno2040.menu.freq.125.build.f_cpu=125000000L
seuno2040.menu.freq.150=150 MHz (Overclock)
seuno2040.menu.freq.150.build.f_cpu=150000000L
seuno2040.menu.freq.175=175 MHz (Overclock)
seuno2040.menu.freq.175.build.f_cpu=175000000L
seuno2040.menu.freq.200=200 MHz (Overclock)
seuno2040.menu.freq.200.build.f_cpu=200000000L
seuno2040.menu.freq.225=225 MHz (Overclock)
seuno2040.menu.freq.225.build.f_cpu=225000000L
seuno2040.menu.freq.250=250 MHz (Overclock)
seuno2040.menu.freq.250.build.f_cpu=250000000L
seuno2040.menu.freq.275=275 MHz (Overclock)
seuno2040.menu.freq.275.build.f_cpu=275000000L
seuno2040.menu.freq.300=300 MHz (Overclock)
seuno2040.menu.freq.300.build.f_cpu=300000000L
seuno2040.menu.opt.Small=Small (-Os) (standard)
seuno2040.menu.opt.Small.build.flags.optimize=-Os
seuno2040.menu.opt.Optimize=Optimize (-O)
seuno2040.menu.opt.Optimize.build.flags.optimize=-O
seuno2040.menu.opt.Optimize2=Optimize More (-O2)
seuno2040.menu.opt.Optimize2.build.flags.optimize=-O2
seuno2040.menu.opt.Optimize3=Optimize Even More (-O3)
seuno2040.menu.opt.Optimize3.build.flags.optimize=-O3
seuno2040.menu.opt.Fast=Fast (-Ofast) (maybe slower)
seuno2040.menu.opt.Fast.build.flags.optimize=-Ofast
seuno2040.menu.opt.Debug=Debug (-Og)
seuno2040.menu.opt.Debug.build.flags.optimize=-Og
seuno2040.menu.rtti.Disabled=Disabled
seuno2040.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
seuno2040.menu.rtti.Enabled=Enabled
seuno2040.menu.rtti.Enabled.build.flags.rtti=
seuno2040.menu.dbgport.Disabled=Disabled
seuno2040.menu.dbgport.Disabled.build.debug_port=
seuno2040.menu.dbgport.Serial=Serial
seuno2040.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
seuno2040.menu.dbgport.Serial1=Serial1
seuno2040.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
seuno2040.menu.dbgport.Serial2=Serial2
seuno2040.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
seuno2040.menu.dbglvl.None=None
seuno2040.menu.dbglvl.None.build.debug_level=
seuno2040.menu.dbglvl.Core=Core
seuno2040.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
seuno2040.menu.dbglvl.SPI=SPI
seuno2040.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
seuno2040.menu.dbglvl.Wire=Wire
seuno2040.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
seuno2040.menu.dbglvl.All=All
seuno2040.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
seuno2040.menu.dbglvl.NDEBUG=NDEBUG
seuno2040.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
seuno2040.menu.usbstack.picosdk=Pico SDK
seuno2040.menu.usbstack.picosdk.build.usbstack_flags="-I{runtime.platform.path}/tools/libpico"
seuno2040.menu.usbstack.tinyusb=Adafruit TinyUSB
seuno2040.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"

