earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Sysis uno2040 (Picoprobe)
# -----------------------------------
seuno2040picoprobe.name=Sysis uno2040 (Picoprobe)
seuno2040picoprobe.vid.0=0x2e8a
seuno2040picoprobe.pid.0=0x0004
seuno2040picoprobe.build.usbpid=-DSERIALUSB_PID=0x000a
seuno2040picoprobe.build.usbpwr=-DUSBD_MAX_POWER_MA=250
seuno2040picoprobe.build.board=SYSIS_UNO_2040
seuno2040picoprobe.build.mcu=cortex-m0plus
seuno2040picoprobe.build.variant=seuno2040
seuno2040picoprobe.upload.tool=picoprobe
seuno2040picoprobe.upload.maximum_size=2097152
seuno2040picoprobe.upload.maximum_data_size=262144
seuno2040picoprobe.upload.wait_for_upload_port=true
seuno2040picoprobe.upload.erase_cmd=
seuno2040picoprobe.serial.disableDTR=false
seuno2040picoprobe.serial.disableRTS=false
seuno2040picoprobe.build.f_cpu=125000000
seuno2040picoprobe.build.led=
seuno2040picoprobe.build.core=rp2040
seuno2040picoprobe.build.ldscript=memmap_default.ld
seuno2040picoprobe.build.ram_length=256k
seuno2040picoprobe.build.boot2=boot2_w25q080_2_padded_checksum
seuno2040picoprobe.build.vid=0x2e8a
seuno2040picoprobe.build.pid=0x000a
seuno2040picoprobe.build.usb_manufacturer="Sysis"
seuno2040picoprobe.build.usb_product="uno2040 (Picoprobe)"
seuno2040picoprobe.menu.flash.2097152_0=2MB (no FS)
seuno2040picoprobe.menu.flash.2097152_0.upload.maximum_size=2093056
seuno2040picoprobe.menu.flash.2097152_0.build.flash_length=2093056
seuno2040picoprobe.menu.flash.2097152_0.build.eeprom_start=270528512
seuno2040picoprobe.menu.flash.2097152_0.build.fs_start=270528512
seuno2040picoprobe.menu.flash.2097152_0.build.fs_end=270528512
seuno2040picoprobe.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
seuno2040picoprobe.menu.flash.2097152_65536.upload.maximum_size=2027520
seuno2040picoprobe.menu.flash.2097152_65536.build.flash_length=2027520
seuno2040picoprobe.menu.flash.2097152_65536.build.eeprom_start=270528512
seuno2040picoprobe.menu.flash.2097152_65536.build.fs_start=270462976
seuno2040picoprobe.menu.flash.2097152_65536.build.fs_end=270528512
seuno2040picoprobe.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
seuno2040picoprobe.menu.flash.2097152_131072.upload.maximum_size=1961984
seuno2040picoprobe.menu.flash.2097152_131072.build.flash_length=1961984
seuno2040picoprobe.menu.flash.2097152_131072.build.eeprom_start=270528512
seuno2040picoprobe.menu.flash.2097152_131072.build.fs_start=270397440
seuno2040picoprobe.menu.flash.2097152_131072.build.fs_end=270528512
seuno2040picoprobe.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
seuno2040picoprobe.menu.flash.2097152_262144.upload.maximum_size=1830912
seuno2040picoprobe.menu.flash.2097152_262144.build.flash_length=1830912
seuno2040picoprobe.menu.flash.2097152_262144.build.eeprom_start=270528512
seuno2040picoprobe.menu.flash.2097152_262144.build.fs_start=270266368
seuno2040picoprobe.menu.flash.2097152_262144.build.fs_end=270528512
seuno2040picoprobe.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
seuno2040picoprobe.menu.flash.2097152_524288.upload.maximum_size=1568768
seuno2040picoprobe.menu.flash.2097152_524288.build.flash_length=1568768
seuno2040picoprobe.menu.flash.2097152_524288.build.eeprom_start=270528512
seuno2040picoprobe.menu.flash.2097152_524288.build.fs_start=270004224
seuno2040picoprobe.menu.flash.2097152_524288.build.fs_end=270528512
seuno2040picoprobe.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
seuno2040picoprobe.menu.flash.2097152_1048576.upload.maximum_size=1044480
seuno2040picoprobe.menu.flash.2097152_1048576.build.flash_length=1044480
seuno2040picoprobe.menu.flash.2097152_1048576.build.eeprom_start=270528512
seuno2040picoprobe.menu.flash.2097152_1048576.build.fs_start=269479936
seuno2040picoprobe.menu.flash.2097152_1048576.build.fs_end=270528512
seuno2040picoprobe.menu.freq.133=133 MHz
seuno2040picoprobe.menu.freq.133.build.f_cpu=133000000L
seuno2040picoprobe.menu.freq.50=50 MHz
seuno2040picoprobe.menu.freq.50.build.f_cpu=50000000L
seuno2040picoprobe.menu.freq.100=100 MHz
seuno2040picoprobe.menu.freq.100.build.f_cpu=100000000L
seuno2040picoprobe.menu.freq.125=125 MHz
seuno2040picoprobe.menu.freq.125.build.f_cpu=125000000L
seuno2040picoprobe.menu.freq.150=150 MHz (Overclock)
seuno2040picoprobe.menu.freq.150.build.f_cpu=150000000L
seuno2040picoprobe.menu.freq.175=175 MHz (Overclock)
seuno2040picoprobe.menu.freq.175.build.f_cpu=175000000L
seuno2040picoprobe.menu.freq.200=200 MHz (Overclock)
seuno2040picoprobe.menu.freq.200.build.f_cpu=200000000L
seuno2040picoprobe.menu.freq.225=225 MHz (Overclock)
seuno2040picoprobe.menu.freq.225.build.f_cpu=225000000L
seuno2040picoprobe.menu.freq.250=250 MHz (Overclock)
seuno2040picoprobe.menu.freq.250.build.f_cpu=250000000L
seuno2040picoprobe.menu.freq.275=275 MHz (Overclock)
seuno2040picoprobe.menu.freq.275.build.f_cpu=275000000L
seuno2040picoprobe.menu.freq.300=300 MHz (Overclock)
seuno2040picoprobe.menu.freq.300.build.f_cpu=300000000L
seuno2040picoprobe.menu.opt.Small=Small (-Os) (standard)
seuno2040picoprobe.menu.opt.Small.build.flags.optimize=-Os
seuno2040picoprobe.menu.opt.Optimize=Optimize (-O)
seuno2040picoprobe.menu.opt.Optimize.build.flags.optimize=-O
seuno2040picoprobe.menu.opt.Optimize2=Optimize More (-O2)
seuno2040picoprobe.menu.opt.Optimize2.build.flags.optimize=-O2
seuno2040picoprobe.menu.opt.Optimize3=Optimize Even More (-O3)
seuno2040picoprobe.menu.opt.Optimize3.build.flags.optimize=-O3
seuno2040picoprobe.menu.opt.Fast=Fast (-Ofast) (maybe slower)
seuno2040picoprobe.menu.opt.Fast.build.flags.optimize=-Ofast
seuno2040picoprobe.menu.opt.Debug=Debug (-Og)
seuno2040picoprobe.menu.opt.Debug.build.flags.optimize=-Og
seuno2040picoprobe.menu.rtti.Disabled=Disabled
seuno2040picoprobe.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
seuno2040picoprobe.menu.rtti.Enabled=Enabled
seuno2040picoprobe.menu.rtti.Enabled.build.flags.rtti=
seuno2040picoprobe.menu.dbgport.Disabled=Disabled
seuno2040picoprobe.menu.dbgport.Disabled.build.debug_port=
seuno2040picoprobe.menu.dbgport.Serial=Serial
seuno2040picoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
seuno2040picoprobe.menu.dbgport.Serial1=Serial1
seuno2040picoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
seuno2040picoprobe.menu.dbgport.Serial2=Serial2
seuno2040picoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
seuno2040picoprobe.menu.dbglvl.None=None
seuno2040picoprobe.menu.dbglvl.None.build.debug_level=
seuno2040picoprobe.menu.dbglvl.Core=Core
seuno2040picoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
seuno2040picoprobe.menu.dbglvl.SPI=SPI
seuno2040picoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
seuno2040picoprobe.menu.dbglvl.Wire=Wire
seuno2040picoprobe.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
seuno2040picoprobe.menu.dbglvl.All=All
seuno2040picoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
seuno2040picoprobe.menu.dbglvl.NDEBUG=NDEBUG
seuno2040picoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
seuno2040picoprobe.menu.usbstack.picosdk=Pico SDK
seuno2040picoprobe.menu.usbstack.picosdk.build.usbstack_flags="-I{runtime.platform.path}/tools/libpico"
seuno2040picoprobe.menu.usbstack.tinyusb=Adafruit TinyUSB
seuno2040picoprobe.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"

# -----------------------------------
# Sysis uno2040 (pico-debug)
# -----------------------------------
seuno2040picodebug.name=Sysis uno2040 (pico-debug)
seuno2040picodebug.vid.0=0x1209
seuno2040picodebug.pid.0=0x2488
seuno2040picodebug.build.usbpid=-DSERIALUSB_PID=0x000a
seuno2040picodebug.build.usbpwr=-DUSBD_MAX_POWER_MA=250
seuno2040picodebug.build.board=SYSIS_UNO_2040
seuno2040picodebug.build.mcu=cortex-m0plus
seuno2040picodebug.build.variant=seuno2040
seuno2040picodebug.upload.tool=picodebug
seuno2040picodebug.upload.maximum_size=2097152
seuno2040picodebug.upload.maximum_data_size=245760
seuno2040picodebug.upload.wait_for_upload_port=true
seuno2040picodebug.upload.erase_cmd=
seuno2040picodebug.serial.disableDTR=false
seuno2040picodebug.serial.disableRTS=false
seuno2040picodebug.build.f_cpu=125000000
seuno2040picodebug.build.led=
seuno2040picodebug.build.core=rp2040
seuno2040picodebug.build.ldscript=memmap_default.ld
seuno2040picodebug.build.ram_length=240k
seuno2040picodebug.build.boot2=boot2_w25q080_2_padded_checksum
seuno2040picodebug.build.vid=0x2e8a
seuno2040picodebug.build.pid=0x000a
seuno2040picodebug.build.usb_manufacturer="Sysis"
seuno2040picodebug.build.usb_product="uno2040 (pico-debug)"
seuno2040picodebug.menu.flash.2097152_0=2MB (no FS)
seuno2040picodebug.menu.flash.2097152_0.upload.maximum_size=2093056
seuno2040picodebug.menu.flash.2097152_0.build.flash_length=2093056
seuno2040picodebug.menu.flash.2097152_0.build.eeprom_start=270528512
seuno2040picodebug.menu.flash.2097152_0.build.fs_start=270528512
seuno2040picodebug.menu.flash.2097152_0.build.fs_end=270528512
seuno2040picodebug.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
seuno2040picodebug.menu.flash.2097152_65536.upload.maximum_size=2027520
seuno2040picodebug.menu.flash.2097152_65536.build.flash_length=2027520
seuno2040picodebug.menu.flash.2097152_65536.build.eeprom_start=270528512
seuno2040picodebug.menu.flash.2097152_65536.build.fs_start=270462976
seuno2040picodebug.menu.flash.2097152_65536.build.fs_end=270528512
seuno2040picodebug.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
seuno2040picodebug.menu.flash.2097152_131072.upload.maximum_size=1961984
seuno2040picodebug.menu.flash.2097152_131072.build.flash_length=1961984
seuno2040picodebug.menu.flash.2097152_131072.build.eeprom_start=270528512
seuno2040picodebug.menu.flash.2097152_131072.build.fs_start=270397440
seuno2040picodebug.menu.flash.2097152_131072.build.fs_end=270528512
seuno2040picodebug.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
seuno2040picodebug.menu.flash.2097152_262144.upload.maximum_size=1830912
seuno2040picodebug.menu.flash.2097152_262144.build.flash_length=1830912
seuno2040picodebug.menu.flash.2097152_262144.build.eeprom_start=270528512
seuno2040picodebug.menu.flash.2097152_262144.build.fs_start=270266368
seuno2040picodebug.menu.flash.2097152_262144.build.fs_end=270528512
seuno2040picodebug.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
seuno2040picodebug.menu.flash.2097152_524288.upload.maximum_size=1568768
seuno2040picodebug.menu.flash.2097152_524288.build.flash_length=1568768
seuno2040picodebug.menu.flash.2097152_524288.build.eeprom_start=270528512
seuno2040picodebug.menu.flash.2097152_524288.build.fs_start=270004224
seuno2040picodebug.menu.flash.2097152_524288.build.fs_end=270528512
seuno2040picodebug.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
seuno2040picodebug.menu.flash.2097152_1048576.upload.maximum_size=1044480
seuno2040picodebug.menu.flash.2097152_1048576.build.flash_length=1044480
seuno2040picodebug.menu.flash.2097152_1048576.build.eeprom_start=270528512
seuno2040picodebug.menu.flash.2097152_1048576.build.fs_start=269479936
seuno2040picodebug.menu.flash.2097152_1048576.build.fs_end=270528512
seuno2040picodebug.menu.freq.133=133 MHz
seuno2040picodebug.menu.freq.133.build.f_cpu=133000000L
seuno2040picodebug.menu.freq.50=50 MHz
seuno2040picodebug.menu.freq.50.build.f_cpu=50000000L
seuno2040picodebug.menu.freq.100=100 MHz
seuno2040picodebug.menu.freq.100.build.f_cpu=100000000L
seuno2040picodebug.menu.freq.125=125 MHz
seuno2040picodebug.menu.freq.125.build.f_cpu=125000000L
seuno2040picodebug.menu.freq.150=150 MHz (Overclock)
seuno2040picodebug.menu.freq.150.build.f_cpu=150000000L
seuno2040picodebug.menu.freq.175=175 MHz (Overclock)
seuno2040picodebug.menu.freq.175.build.f_cpu=175000000L
seuno2040picodebug.menu.freq.200=200 MHz (Overclock)
seuno2040picodebug.menu.freq.200.build.f_cpu=200000000L
seuno2040picodebug.menu.freq.225=225 MHz (Overclock)
seuno2040picodebug.menu.freq.225.build.f_cpu=225000000L
seuno2040picodebug.menu.freq.250=250 MHz (Overclock)
seuno2040picodebug.menu.freq.250.build.f_cpu=250000000L
seuno2040picodebug.menu.freq.275=275 MHz (Overclock)
seuno2040picodebug.menu.freq.275.build.f_cpu=275000000L
seuno2040picodebug.menu.freq.300=300 MHz (Overclock)
seuno2040picodebug.menu.freq.300.build.f_cpu=300000000L
seuno2040picodebug.menu.opt.Small=Small (-Os) (standard)
seuno2040picodebug.menu.opt.Small.build.flags.optimize=-Os
seuno2040picodebug.menu.opt.Optimize=Optimize (-O)
seuno2040picodebug.menu.opt.Optimize.build.flags.optimize=-O
seuno2040picodebug.menu.opt.Optimize2=Optimize More (-O2)
seuno2040picodebug.menu.opt.Optimize2.build.flags.optimize=-O2
seuno2040picodebug.menu.opt.Optimize3=Optimize Even More (-O3)
seuno2040picodebug.menu.opt.Optimize3.build.flags.optimize=-O3
seuno2040picodebug.menu.opt.Fast=Fast (-Ofast) (maybe slower)
seuno2040picodebug.menu.opt.Fast.build.flags.optimize=-Ofast
seuno2040picodebug.menu.opt.Debug=Debug (-Og)
seuno2040picodebug.menu.opt.Debug.build.flags.optimize=-Og
seuno2040picodebug.menu.rtti.Disabled=Disabled
seuno2040picodebug.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
seuno2040picodebug.menu.rtti.Enabled=Enabled
seuno2040picodebug.menu.rtti.Enabled.build.flags.rtti=
seuno2040picodebug.menu.dbgport.Disabled=Disabled
seuno2040picodebug.menu.dbgport.Disabled.build.debug_port=
seuno2040picodebug.menu.dbgport.Serial=Serial
seuno2040picodebug.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
seuno2040picodebug.menu.dbgport.Serial1=Serial1
seuno2040picodebug.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
seuno2040picodebug.menu.dbgport.Serial2=Serial2
seuno2040picodebug.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
seuno2040picodebug.menu.dbglvl.None=None
seuno2040picodebug.menu.dbglvl.None.build.debug_level=
seuno2040picodebug.menu.dbglvl.Core=Core
seuno2040picodebug.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
seuno2040picodebug.menu.dbglvl.SPI=SPI
seuno2040picodebug.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
seuno2040picodebug.menu.dbglvl.Wire=Wire
seuno2040picodebug.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
seuno2040picodebug.menu.dbglvl.All=All
seuno2040picodebug.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
seuno2040picodebug.menu.dbglvl.NDEBUG=NDEBUG
seuno2040picodebug.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
seuno2040picodebug.menu.usbstack.nousb=No USB
seuno2040picodebug.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
